# -*- coding: utf-8 -*-

from random import randrange

_dupeWith = ["ослом", "вагонеткой", "воронкой", "лавой", "поршнем", "кактусом", "ламой", "верстаком", "книгой",
             "порталом", "лодкой", "рестартом", "хаусмастером"]

_kogo = ["осла", "портал", "другого игрока", "лаву", "поршень", "ламу", "раздатчик", "лодку", "воронку", "кнопку",
         "чанк", "пакет", "ресурсы", "динамит"]

_net = ["осла", "портала", "другого игрока", "лавы", "поршня", "ламы", "раздатчика", "лодки", "воронки", "кнопки",
        "чанков", "пакетов", "ресурсов", "динамита"]

_steps = ["Поместите %1 в %2", "%d ресурсы из %3", "Убедитесь, что вы правильно установили %1",
          "%d, пока %3 не останется", "Выключите %1 и включите %2", "%d %1", "Взорвите %1 и %2", "Разлейте лаву на %1"]

_do = ["Ждите", "Выключите", "Включите", "Заберите", "Толкните", "Выбросьте", "Возьмите", "Взрывайте"]


def gen(amount):
    rtn = ""
    rtn += "Дюп с %1 и %2\n\n".replace("%1", _dupeWith[_rand(_dupeWith)]).replace("%2", _dupeWith[_rand(_dupeWith)])
    done = 1
    while done < int(amount):
        rtn += (str(done) + ". " + _steps[_rand(_steps)] + "\n").replace("%1", _kogo[_rand(_kogo)]).replace("%2", _kogo[_rand(_kogo)]) \
              .replace("%3", _net[_rand(_kogo)]).replace("%4", _net[_rand(_kogo)]).replace("%d", _do[_rand(_do)])
        done += 1
    rtn += str(done) + ". Заберите дюпнутые ресурсы"
    return rtn


def _rand(array):
    return randrange(0, len(array), 1)
